-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.4.24-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.1.0.6537
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- rec_18_19 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `rec_18_19` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;
USE `rec_18_19`;

-- 테이블 rec_18_19.east 구조 내보내기
CREATE TABLE IF NOT EXISTS `east` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- 테이블 데이터 rec_18_19.east:~15 rows (대략적) 내보내기
DELETE FROM `east`;
INSERT INTO `east` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '밀워키', 'CEN', '82', '60', '22', '0.732', '0.0', '33', '8', '27', '14', '14', '2', '1패'),
	('2', '토론토', 'ATL', '82', '58', '24', '0.707', '2.0', '32', '9', '26', '15', '12', '4', '2승'),
	('3', '필라델피아', 'ATL', '82', '51', '31', '0.622', '9.0', '31', '10', '20', '21', '8', '8', '1승'),
	('4', '보스턴', 'ATL', '82', '49', '33', '0.598', '11.0', '28', '13', '21', '20', '10', '6', '1승'),
	('5', '인디애나', 'CEN', '82', '48', '34', '0.585', '12.0', '29', '12', '19', '22', '11', '5', '1승'),
	('6', '브루클린', 'ATL', '82', '42', '40', '0.512', '18.0', '23', '18', '19', '22', '8', '8', '3승'),
	('7', '올랜도', 'SEA', '82', '42', '40', '0.512', '18.0', '25', '16', '17', '24', '10', '6', '4승'),
	('8', '디트로이트', 'CEN', '82', '41', '41', '0.500', '19.0', '26', '15', '15', '26', '8', '8', '2승'),
	('9', '샬럿', 'SEA', '82', '39', '43', '0.476', '21.0', '25', '16', '14', '27', '10', '6', '1패'),
	('10', '마이애미', 'SEA', '82', '39', '43', '0.476', '21.0', '19', '22', '20', '21', '7', '9', '1패'),
	('11', '워싱턴', 'SEA', '82', '32', '50', '0.390', '28.0', '22', '19', '10', '31', '7', '9', '4패'),
	('12', '애틀랜타', 'SEA', '82', '29', '53', '0.354', '31.0', '17', '24', '12', '29', '6', '10', '3패'),
	('13', '시카고', 'CEN', '82', '22', '60', '0.268', '38.0', '9', '32', '13', '28', '3', '13', '3패'),
	('14', '클리블랜드', 'CEN', '82', '19', '63', '0.232', '41.0', '13', '28', '6', '35', '4', '12', '10패'),
	('15', '뉴욕', 'ATL', '82', '17', '65', '0.207', '43.0', '9', '32', '8', '33', '2', '14', '1패');

-- 테이블 rec_18_19.player 구조 내보내기
CREATE TABLE IF NOT EXISTS `player` (
  `순위` varchar(50) DEFAULT NULL,
  `선수` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `득점` varchar(50) DEFAULT NULL,
  `어시스트` varchar(50) DEFAULT NULL,
  `리바운드` varchar(50) DEFAULT NULL,
  `스틸` varchar(50) DEFAULT NULL,
  `블락슛` varchar(50) DEFAULT NULL,
  `야투` varchar(50) DEFAULT NULL,
  `3점슛` varchar(50) DEFAULT NULL,
  `자유투` varchar(50) DEFAULT NULL,
  `야투성공률` varchar(50) DEFAULT NULL,
  `3점슛성공률` varchar(50) DEFAULT NULL,
  `자유투성공률` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- 테이블 데이터 rec_18_19.player:~20 rows (대략적) 내보내기
DELETE FROM `player`;
INSERT INTO `player` (`순위`, `선수`, `경기수`, `득점`, `어시스트`, `리바운드`, `스틸`, `블락슛`, `야투`, `3점슛`, `자유투`, `야투성공률`, `3점슛성공률`, `자유투성공률`) VALUES
	('1', '제임스 하든 (휴스턴)', '78', '36.1', '7.5', '6.6', '2.0', '0.7', '10.8', '4.8', '9.7', '44.2', '36.8', '87.9'),
	('2', '폴 조지 (LAC)', '77', '28.0', '4.1', '8.2', '2.2', '0.4', '9.2', '3.8', '5.9', '43.8', '38.6', '83.9'),
	('3', '야니스 아데토쿤보 (밀워키)', '72', '27.7', '5.9', '12.5', '1.3', '1.5', '10.0', '0.7', '6.9', '57.8', '25.6', '72.9'),
	('4', '조엘 엠비드 (필라델피아)', '64', '27.5', '3.7', '13.6', '0.7', '1.9', '9.1', '1.2', '8.2', '48.4', '30.0', '80.4'),
	('5', '스테판 커리 (골든스테이트)', '69', '27.3', '5.2', '5.3', '1.3', '0.4', '9.2', '5.1', '3.8', '47.2', '43.7', '91.6'),
	('6', '데빈 부커 (피닉스)', '64', '26.6', '6.8', '4.1', '0.9', '0.2', '9.2', '2.1', '6.1', '46.7', '32.6', '86.6'),
	('6', '카와이 레너드 (LAC)', '60', '26.6', '3.3', '7.3', '1.8', '0.4', '9.3', '1.9', '6.1', '49.6', '37.1', '85.4'),
	('8', '케빈 듀란트 (브루클린)', '78', '26.0', '5.9', '6.4', '0.7', '1.1', '9.2', '1.8', '5.7', '52.1', '35.3', '88.5'),
	('9', '데미안 릴라드 (포틀랜드)', '80', '25.8', '6.9', '4.6', '1.1', '0.4', '8.5', '3.0', '5.8', '44.4', '36.9', '91.2'),
	('10', '브래들리 빌 (워싱턴)', '82', '25.6', '5.5', '5.0', '1.5', '0.7', '9.3', '2.6', '4.4', '47.5', '35.1', '80.8'),
	('10', '켐바 워커 (보스턴)', '82', '25.6', '5.9', '4.4', '1.2', '0.4', '8.9', '3.2', '4.6', '43.4', '35.6', '84.4'),
	('12', '블레이크 그리핀 (디트로이트)', '75', '24.5', '5.4', '7.5', '0.7', '0.4', '8.2', '2.5', '5.5', '46.2', '36.2', '75.3'),
	('13', '칼-앤서니 타운스 (미네소타)', '77', '24.4', '3.4', '12.4', '0.9', '1.6', '8.8', '1.8', '4.9', '51.8', '40.0', '83.6'),
	('14', '도노반 미첼 (유타)', '77', '23.8', '4.2', '4.1', '1.4', '0.4', '8.6', '2.4', '4.1', '43.2', '36.2', '80.6'),
	('14', '카이리 어빙 (브루클린)', '67', '23.8', '6.9', '5.0', '1.5', '0.5', '9.0', '2.6', '3.2', '48.7', '40.1', '87.3'),
	('16', '잭 라빈 (시카고)', '63', '23.7', '4.5', '4.7', '1.0', '0.4', '8.4', '1.9', '5.0', '46.7', '37.4', '83.2'),
	('17', '러셀 웨스트브룩 (휴스턴)', '73', '22.9', '10.7', '11.1', '2.0', '0.4', '8.6', '1.6', '4.0', '42.8', '29.0', '65.6'),
	('18', '클레이 톰슨 (골든스테이트)', '78', '21.5', '2.4', '3.8', '1.1', '0.6', '8.4', '3.1', '1.6', '46.7', '40.2', '81.6'),
	('19', '줄리어스 랜들 (뉴욕)', '73', '21.4', '3.1', '8.7', '0.7', '0.6', '7.8', '0.9', '4.9', '52.4', '34.4', '73.1'),
	('20', '라마커스 알드리...(샌안토니오)', '81', '21.3', '2.4', '9.2', '0.5', '1.3', '8.4', '0.1', '4.3', '51.9', '23.8', '84.7');

-- 테이블 rec_18_19.west 구조 내보내기
CREATE TABLE IF NOT EXISTS `west` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_18_19.west:~15 rows (대략적) 내보내기
DELETE FROM `west`;
INSERT INTO `west` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '골든스테이트', 'PAC', '82', '57', '25', '0.695', '0.0', '30', '11', '27', '14', '13', '3', '1패'),
	('2', '덴버', 'NWE', '82', '54', '28', '0.659', '3.0', '34', '7', '20', '21', '12', '4', '1승'),
	('3', '포틀랜드', 'NWE', '82', '53', '29', '0.646', '4.0', '32', '9', '21', '20', '6', '10', '3승'),
	('4', '휴스턴', 'SWE', '82', '53', '29', '0.646', '4.0', '31', '10', '22', '19', '10', '6', '1패'),
	('5', '유타', 'NWE', '82', '50', '32', '0.610', '7.0', '29', '12', '21', '20', '8', '8', '1패'),
	('6', '오클라호마 시티', 'NWE', '82', '49', '33', '0.598', '8.0', '27', '14', '22', '19', '9', '7', '5승'),
	('7', '샌안토니오', 'SWE', '82', '48', '34', '0.585', '9.0', '32', '9', '16', '25', '10', '6', '3승'),
	('8', 'LAC', 'PAC', '82', '48', '34', '0.585', '9.0', '26', '15', '22', '19', '11', '5', '1승'),
	('9', '새크라멘토', 'PAC', '82', '39', '43', '0.476', '18.0', '24', '17', '15', '26', '4', '12', '3패'),
	('10', 'LAL', 'PAC', '82', '37', '45', '0.451', '20.0', '22', '19', '15', '26', '9', '7', '1패'),
	('11', '미네소타', 'NWE', '82', '36', '46', '0.439', '21.0', '25', '16', '11', '30', '5', '11', '3패'),
	('12', '멤피스', 'SWE', '82', '33', '49', '0.402', '24.0', '21', '20', '12', '29', '8', '8', '1승'),
	('13', '뉴올리언스', 'SWE', '82', '33', '49', '0.402', '24.0', '19', '22', '14', '27', '8', '8', '1패'),
	('14', '댈러스', 'SWE', '82', '33', '49', '0.402', '24.0', '24', '17', '9', '32', '4', '12', '1패'),
	('15', '피닉스', 'PAC', '82', '19', '63', '0.232', '38.0', '12', '29', '7', '34', '3', '13', '2패');


-- rec_19_20 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `rec_19_20` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;
USE `rec_19_20`;

-- 테이블 rec_19_20.east 구조 내보내기
CREATE TABLE IF NOT EXISTS `east` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_19_20.east:~15 rows (대략적) 내보내기
DELETE FROM `east`;
INSERT INTO `east` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '밀워키', 'CEN', '73', '56', '17', '0.767', '0.0', '30', '5', '26', '12', '13', '1', '1패'),
	('2', '토론토', 'ATL', '72', '53', '19', '0.736', '2.5', '26', '10', '27', '9', '9', '5', '4승'),
	('3', '보스턴', 'ATL', '72', '48', '24', '0.667', '7.5', '26', '10', '22', '14', '9', '6', '1패'),
	('4', '인디애나', 'CEN', '73', '45', '28', '0.616', '11.0', '25', '11', '20', '17', '8', '7', '2승'),
	('5', '마이애미', 'SEA', '73', '44', '29', '0.603', '12.0', '29', '7', '15', '22', '10', '4', '2패'),
	('6', '필라델피아', 'ATL', '73', '43', '30', '0.589', '13.0', '31', '4', '12', '26', '11', '5', '1승'),
	('7', '브루클린', 'ATL', '72', '35', '37', '0.486', '20.5', '20', '16', '15', '21', '6', '10', '1패'),
	('8', '올랜도', 'SEA', '73', '33', '40', '0.452', '23.0', '18', '17', '15', '23', '9', '5', '1승'),
	('9', '워싱턴', 'SEA', '72', '25', '47', '0.347', '30.5', '16', '20', '9', '27', '5', '9', '1승'),
	('10', '샬럿', 'SEA', '65', '23', '42', '0.354', '29.0', '10', '21', '13', '21', '2', '7', '1승'),
	('11', '시카고', 'CEN', '65', '22', '43', '0.338', '30.0', '14', '20', '8', '23', '7', '9', '1승'),
	('12', '뉴욕', 'ATL', '66', '21', '45', '0.318', '31.5', '11', '22', '10', '23', '2', '11', '1승'),
	('13', '디트로이트', 'CEN', '66', '20', '46', '0.303', '32.5', '11', '22', '9', '24', '5', '10', '5패'),
	('14', '애틀랜타', 'SEA', '67', '20', '47', '0.299', '33.0', '14', '20', '6', '27', '6', '7', '1패'),
	('15', '클리블랜드', 'CEN', '65', '19', '46', '0.292', '33.0', '11', '25', '8', '21', '4', '10', '1패');

-- 테이블 rec_19_20.player 구조 내보내기
CREATE TABLE IF NOT EXISTS `player` (
  `순위` varchar(50) DEFAULT NULL,
  `선수` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `득점` varchar(50) DEFAULT NULL,
  `어시스트` varchar(50) DEFAULT NULL,
  `리바운드` varchar(50) DEFAULT NULL,
  `스틸` varchar(50) DEFAULT NULL,
  `블락슛` varchar(50) DEFAULT NULL,
  `야투` varchar(50) DEFAULT NULL,
  `3점슛` varchar(50) DEFAULT NULL,
  `자유투` varchar(50) DEFAULT NULL,
  `야투성공률` varchar(50) DEFAULT NULL,
  `3점슛성공률` varchar(50) DEFAULT NULL,
  `자유투성공률` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_19_20.player:~20 rows (대략적) 내보내기
DELETE FROM `player`;
INSERT INTO `player` (`순위`, `선수`, `경기수`, `득점`, `어시스트`, `리바운드`, `스틸`, `블락슛`, `야투`, `3점슛`, `자유투`, `야투성공률`, `3점슛성공률`, `자유투성공률`) VALUES
	('1', '제임스 하든 (브루클린)', '68', '34.3', '7.5', '6.6', '1.8', '0.9', '9.9', '4.4', '10.2', '44.4', '35.5', '86.5'),
	('2', '브래들리 빌 (워싱턴)', '57', '30.5', '6.1', '4.2', '1.2', '0.4', '10.4', '3.0', '6.8', '45.5', '35.3', '84.2'),
	('3', '데미안 릴라드 (포틀랜드)', '66', '30.0', '8.0', '4.3', '1.1', '0.3', '9.4', '4.1', '7.0', '46.3', '40.1', '88.8'),
	('4', '트레 영 (애틀랜타)', '60', '29.6', '9.3', '4.3', '1.1', '0.1', '9.1', '3.4', '8.0', '43.7', '36.1', '86.0'),
	('5', '야니스 아데토쿤보 (밀워키)', '63', '29.5', '5.6', '13.6', '1.0', '1.0', '10.9', '1.4', '6.3', '55.3', '30.4', '63.3'),
	('6', '루카 돈치치 (댈러스)', '61', '28.8', '8.8', '9.4', '1.0', '0.2', '9.5', '2.8', '7.0', '46.3', '31.6', '75.8'),
	('7', '러셀 웨스트브룩 (LAL)', '57', '27.2', '7.0', '7.9', '1.6', '0.4', '10.6', '1.0', '5.1', '47.2', '25.8', '76.3'),
	('8', '카와이 레너드 (LAC)', '57', '27.1', '4.9', '7.1', '1.8', '0.6', '9.3', '2.2', '6.2', '47.0', '37.8', '88.6'),
	('9', '데빈 부커 (피닉스)', '70', '26.6', '6.5', '4.2', '0.7', '0.3', '9.0', '2.0', '6.7', '48.9', '35.4', '91.9'),
	('10', '앤서니 데이비스 (LAL)', '62', '26.1', '3.2', '9.3', '1.5', '2.3', '8.9', '1.2', '7.2', '50.3', '33.0', '84.6'),
	('11', '잭 라빈 (시카고)', '60', '25.5', '4.2', '4.8', '1.5', '0.5', '9.0', '3.1', '4.5', '45.0', '38.0', '80.2'),
	('12', '르브론 제임스 (LAL)', '67', '25.3', '10.2', '7.8', '1.2', '0.5', '9.6', '2.2', '3.9', '49.3', '34.8', '69.3'),
	('13', '도노반 미첼 (유타)', '69', '24.0', '4.3', '4.4', '1.0', '0.2', '8.7', '2.5', '4.0', '44.9', '36.6', '86.3'),
	('14', '브랜든 잉그램 (뉴올리언스)', '62', '23.8', '4.2', '6.1', '1.0', '0.6', '8.2', '2.4', '5.0', '46.3', '39.1', '85.1'),
	('15', '제이슨 테이텀 (보스턴)', '66', '23.4', '3.0', '7.0', '1.4', '0.9', '8.4', '2.9', '3.8', '45.0', '40.3', '81.2'),
	('16', '디안젤로 러셀 (미네소타)', '45', '23.1', '6.3', '3.9', '1.1', '0.3', '8.0', '3.5', '3.6', '42.6', '36.7', '80.9'),
	('17', '파스칼 시아캄 (토론토)', '60', '22.9', '3.5', '7.3', '1.0', '0.9', '8.3', '2.2', '4.0', '45.3', '35.9', '79.2'),
	('18', 'C.J. 맥컬럼 (포틀랜드)', '70', '22.2', '4.4', '4.2', '0.8', '0.6', '8.7', '2.8', '2.0', '45.1', '37.9', '75.7'),
	('19', '더마 드로잔 (시카고)', '68', '22.1', '5.6', '5.5', '1.0', '0.3', '8.2', '0.1', '5.6', '53.1', '25.7', '84.5'),
	('20', '앤드류 위긴스 (골든스테이트)', '54', '21.8', '3.7', '5.1', '0.8', '1.0', '8.1', '2.1', '3.5', '44.7', '33.2', '70.9');

-- 테이블 rec_19_20.west 구조 내보내기
CREATE TABLE IF NOT EXISTS `west` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_19_20.west:~15 rows (대략적) 내보내기
DELETE FROM `west`;
INSERT INTO `west` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', 'LAL', 'PAC', '71', '52', '19', '0.732', '0.0', '25', '10', '27', '9', '10', '3', '1패'),
	('2', 'LAC', 'PAC', '72', '49', '23', '0.681', '3.5', '27', '9', '22', '14', '8', '6', '2승'),
	('3', '덴버', 'NWE', '73', '46', '27', '0.630', '7.0', '26', '11', '20', '16', '12', '2', '3패'),
	('4', '휴스턴', 'SWE', '72', '44', '28', '0.611', '8.5', '24', '12', '20', '16', '8', '5', '3패'),
	('5', '오클라호마시티', 'NWE', '72', '44', '28', '0.611', '8.5', '23', '14', '21', '14', '8', '5', '1패'),
	('6', '유타', 'NWE', '72', '44', '28', '0.611', '8.5', '23', '12', '21', '16', '5', '7', '1승'),
	('7', '댈러스', 'SWE', '75', '43', '32', '0.573', '11.0', '20', '18', '23', '14', '10', '4', '2패'),
	('8', '포틀랜드', 'NWE', '74', '35', '39', '0.473', '18.5', '21', '15', '14', '24', '5', '8', '3승'),
	('9', '멤피스', 'SWE', '73', '34', '39', '0.466', '19.0', '20', '17', '14', '22', '4', '9', '1승'),
	('10', '피닉스', 'PAC', '73', '34', '39', '0.466', '19.0', '17', '22', '17', '17', '6', '9', '8승'),
	('11', '샌안토니오', 'SWE', '71', '32', '39', '0.451', '20.0', '19', '15', '13', '24', '7', '6', '1패'),
	('12', '새크라멘토', 'PAC', '72', '31', '41', '0.431', '21.5', '16', '19', '15', '22', '8', '5', '2승'),
	('13', '뉴올리언스', 'SWE', '72', '30', '42', '0.417', '22.5', '15', '21', '15', '21', '4', '9', '3패'),
	('14', '미네소타', 'NWE', '64', '19', '45', '0.297', '29.5', '8', '24', '11', '21', '2', '10', '3패'),
	('15', '골든스테이트', 'PAC', '65', '15', '50', '0.231', '34.0', '8', '26', '7', '24', '2', '11', '1패');


-- rec_20_21 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `rec_20_21` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;
USE `rec_20_21`;

-- 테이블 rec_20_21.east 구조 내보내기
CREATE TABLE IF NOT EXISTS `east` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_20_21.east:~15 rows (대략적) 내보내기
DELETE FROM `east`;
INSERT INTO `east` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '필라델피아', 'ATL', '72', '49', '23', '0.681', '0.0', '29', '7', '20', '16', '10', '2', '2승'),
	('2', '브루클린', 'ATL', '72', '48', '24', '0.667', '1.0', '28', '8', '20', '16', '8', '4', '5승'),
	('3', '밀워키', 'CEN', '72', '46', '26', '0.639', '3.0', '26', '10', '20', '16', '11', '1', '1패'),
	('4', '뉴욕', 'ATL', '72', '41', '31', '0.569', '8.0', '25', '11', '16', '20', '4', '8', '3승'),
	('5', '애틀랜타', 'SEA', '72', '41', '31', '0.569', '8.0', '25', '11', '16', '20', '9', '3', '4승'),
	('6', '마이애미', 'SEA', '72', '40', '32', '0.556', '9.0', '21', '15', '19', '17', '6', '6', '1승'),
	('7', '보스턴', 'ATL', '72', '36', '36', '0.500', '13.0', '21', '15', '15', '21', '4', '8', '1패'),
	('8', '워싱턴', 'SEA', '72', '34', '38', '0.472', '15.0', '19', '17', '15', '21', '3', '9', '2승'),
	('9', '인디애나', 'CEN', '72', '34', '38', '0.472', '15.0', '13', '23', '21', '15', '7', '5', '1승'),
	('10', '샬럿', 'SEA', '72', '33', '39', '0.458', '16.0', '18', '18', '15', '21', '8', '4', '5패'),
	('11', '시카고', 'CEN', '72', '31', '41', '0.431', '18.0', '15', '21', '16', '20', '7', '5', '1승'),
	('12', '토론토', 'ATL', '72', '27', '45', '0.375', '22.0', '16', '20', '11', '25', '4', '8', '7패'),
	('13', '클리블랜드', 'CEN', '72', '22', '50', '0.306', '27.0', '13', '23', '9', '27', '4', '8', '2패'),
	('14', '올랜도', 'SEA', '72', '21', '51', '0.292', '28.0', '11', '25', '10', '26', '4', '8', '7패'),
	('15', '디트로이트', 'CEN', '72', '20', '52', '0.278', '29.0', '13', '23', '7', '29', '1', '11', '5패');

-- 테이블 rec_20_21.player 구조 내보내기
CREATE TABLE IF NOT EXISTS `player` (
  `순위` varchar(50) DEFAULT NULL,
  `선수` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `득점` varchar(50) DEFAULT NULL,
  `어시스트` varchar(50) DEFAULT NULL,
  `리바운드` varchar(50) DEFAULT NULL,
  `스틸` varchar(50) DEFAULT NULL,
  `블락슛` varchar(50) DEFAULT NULL,
  `야투` varchar(50) DEFAULT NULL,
  `3점슛` varchar(50) DEFAULT NULL,
  `자유투` varchar(50) DEFAULT NULL,
  `야투성공률` varchar(50) DEFAULT NULL,
  `3점슛성공률` varchar(50) DEFAULT NULL,
  `자유투성공률` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_20_21.player:~20 rows (대략적) 내보내기
DELETE FROM `player`;
INSERT INTO `player` (`순위`, `선수`, `경기수`, `득점`, `어시스트`, `리바운드`, `스틸`, `블락슛`, `야투`, `3점슛`, `자유투`, `야투성공률`, `3점슛성공률`, `자유투성공률`) VALUES
	('1', '스테판 커리 (골든스테이트)', '63', '32.0', '5.8', '5.5', '1.2', '0.1', '10.4', '5.4', '5.8', '48.2', '42.1', '91.6'),
	('2', '브래들리 빌 (워싱턴)', '60', '31.3', '4.4', '4.7', '1.2', '0.4', '11.2', '2.2', '6.8', '48.5', '34.9', '88.9'),
	('3', '데미안 릴라드 (포틀랜드)', '67', '28.8', '7.5', '4.2', '0.9', '0.2', '9.0', '4.1', '6.7', '45.1', '39.1', '92.8'),
	('4', '조엘 엠비드 (필라델피아)', '51', '28.5', '2.8', '10.6', '1.0', '1.4', '9.0', '1.1', '9.2', '51.3', '37.7', '85.9'),
	('5', '야니스 아데토쿤보 (밀워키)', '61', '28.1', '5.9', '11.0', '1.2', '1.2', '10.3', '1.1', '6.5', '56.9', '30.3', '68.5'),
	('6', '루카 돈치치 (댈러스)', '66', '27.7', '8.6', '8.0', '1.0', '0.6', '9.8', '2.9', '5.2', '47.9', '35.0', '73.0'),
	('7', '잭 라빈 (시카고)', '58', '27.4', '4.9', '5.0', '0.8', '0.5', '9.8', '3.4', '4.4', '50.7', '41.9', '84.9'),
	('8', '자이온 윌리엄슨 (뉴올리언스)', '61', '27.0', '3.7', '7.2', '0.9', '0.6', '10.4', '0.2', '6.0', '61.1', '29.4', '69.8'),
	('9', '카이리 어빙 (브루클린)', '54', '26.9', '6.0', '4.8', '1.4', '0.7', '10.2', '2.8', '3.7', '50.6', '40.2', '92.2'),
	('10', '니콜라 요키치 (덴버)', '72', '26.4', '8.3', '10.8', '1.3', '0.7', '10.2', '1.3', '4.8', '56.6', '38.8', '86.8'),
	('10', '도노반 미첼 (유타)', '53', '26.4', '5.2', '4.4', '1.0', '0.3', '9.0', '3.4', '5.0', '43.8', '38.6', '84.5'),
	('10', '제이슨 테이텀 (보스턴)', '64', '26.4', '4.3', '7.4', '1.2', '0.5', '9.4', '2.9', '4.6', '45.9', '38.6', '86.8'),
	('13', '데빈 부커 (피닉스)', '67', '25.6', '4.3', '4.2', '0.8', '0.2', '9.3', '1.9', '5.1', '48.4', '34.0', '86.7'),
	('14', '트레 영 (애틀랜타)', '63', '25.3', '9.4', '3.9', '0.8', '0.2', '7.7', '2.2', '7.7', '43.8', '34.3', '88.6'),
	('15', '디애런 팍스 (새크라멘토)', '58', '25.2', '7.2', '3.5', '1.5', '0.5', '9.1', '1.8', '5.2', '47.7', '32.2', '71.9'),
	('16', '카와이 레너드 (LAC)', '52', '24.8', '5.2', '6.5', '1.6', '0.4', '8.9', '1.9', '5.0', '51.2', '39.8', '88.5'),
	('17', '제이렌 브라운 (보스턴)', '58', '24.7', '3.4', '6.0', '1.2', '0.6', '9.3', '2.8', '3.3', '48.4', '39.7', '76.4'),
	('18', '콜린 섹스턴 (클리블랜드)', '60', '24.3', '4.4', '3.1', '1.0', '0.2', '8.8', '1.6', '5.2', '47.5', '37.1', '81.5'),
	('19', '줄리어스 랜들 (뉴욕)', '71', '24.1', '6.0', '10.2', '0.9', '0.2', '8.5', '2.2', '4.9', '45.6', '41.1', '81.1'),
	('20', '브랜든 잉그램 (뉴올리언스)', '61', '23.8', '4.9', '4.9', '0.7', '0.6', '8.4', '2.3', '4.6', '46.6', '38.1', '87.8');

-- 테이블 rec_20_21.west 구조 내보내기
CREATE TABLE IF NOT EXISTS `west` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_20_21.west:~15 rows (대략적) 내보내기
DELETE FROM `west`;
INSERT INTO `west` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '유타', 'NWE', '72', '52', '20', '0.722', '0.0', '31', '5', '21', '15', '7', '5', '2승'),
	('2', '피닉스', 'PAC', '72', '51', '21', '0.708', '1.0', '27', '9', '24', '12', '7', '5', '3승'),
	('3', '덴버', 'NWE', '72', '47', '25', '0.653', '5.0', '25', '11', '22', '14', '9', '3', '1패'),
	('4', 'LAC', 'PAC', '72', '47', '25', '0.653', '5.0', '26', '10', '21', '15', '9', '3', '2패'),
	('5', '댈러스', 'SWE', '72', '42', '30', '0.583', '10.0', '21', '15', '21', '15', '7', '5', '1패'),
	('6', '포틀랜드', 'NWE', '72', '42', '30', '0.583', '10.0', '20', '16', '22', '14', '6', '6', '1승'),
	('7', 'LAL', 'PAC', '72', '42', '30', '0.583', '10.0', '21', '15', '21', '15', '4', '8', '5승'),
	('8', '골든스테이트', 'PAC', '72', '39', '33', '0.542', '13.0', '25', '11', '14', '22', '5', '7', '6승'),
	('9', '멤피스', 'SWE', '72', '38', '34', '0.528', '14.0', '18', '18', '20', '16', '6', '6', '1패'),
	('10', '샌안토니오', 'SWE', '72', '33', '39', '0.458', '19.0', '14', '22', '19', '17', '6', '6', '4패'),
	('11', '뉴올리언스', 'SWE', '72', '31', '41', '0.431', '21.0', '18', '18', '13', '23', '6', '6', '4패'),
	('12', '새크라멘토', 'PAC', '72', '31', '41', '0.431', '21.0', '16', '20', '15', '21', '5', '7', '3패'),
	('13', '미네소타', 'NWE', '72', '23', '49', '0.319', '29.0', '13', '23', '10', '26', '5', '7', '1승'),
	('14', '오클라호마 시티', 'NWE', '72', '22', '50', '0.306', '30.0', '10', '26', '12', '24', '3', '9', '1승'),
	('15', '휴스턴', 'SWE', '72', '17', '55', '0.236', '35.0', '9', '27', '8', '28', '5', '7', '1패');


-- rec_21_22 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `rec_21_22` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;
USE `rec_21_22`;

-- 테이블 rec_21_22.east 구조 내보내기
CREATE TABLE IF NOT EXISTS `east` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_21_22.east:~15 rows (대략적) 내보내기
DELETE FROM `east`;
INSERT INTO `east` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '마이애미', 'SEA', '82', '53', '29', '0.646', '0.0', '29', '12', '24', '17', '13', '3', '1패'),
	('2', '보스턴', 'ATL', '82', '51', '31', '0.622', '2.0', '28', '13', '23', '18', '9', '7', '1승'),
	('3', '밀워키', 'CEN', '82', '51', '31', '0.622', '2.0', '27', '14', '24', '17', '12', '4', '1패'),
	('4', '필라델피아', 'ATL', '82', '51', '31', '0.622', '2.0', '24', '17', '27', '14', '6', '10', '2승'),
	('5', '토론토', 'ATL', '82', '48', '34', '0.585', '5.0', '24', '17', '24', '17', '10', '6', '1패'),
	('6', '시카고', 'CEN', '82', '46', '36', '0.561', '7.0', '27', '14', '19', '22', '10', '6', '1승'),
	('7', '브루클린', 'ATL', '82', '44', '38', '0.537', '9.0', '20', '21', '24', '17', '10', '6', '4승'),
	('8', '애틀랜타', 'SEA', '82', '43', '39', '0.524', '10.0', '27', '14', '16', '25', '9', '7', '1승'),
	('9', '클리블랜드', 'CEN', '82', '44', '38', '0.537', '9.0', '25', '16', '19', '22', '10', '6', '1승'),
	('10', '샬럿', 'SEA', '82', '43', '39', '0.524', '10.0', '22', '19', '21', '20', '8', '8', '3승'),
	('11', '뉴욕', 'ATL', '82', '37', '45', '0.451', '16.0', '17', '24', '20', '21', '5', '11', '2승'),
	('12', '워싱턴', 'SEA', '82', '35', '47', '0.427', '18.0', '21', '20', '14', '27', '7', '9', '3패'),
	('13', '인디애나', 'CEN', '82', '25', '57', '0.305', '28.0', '16', '25', '9', '32', '2', '14', '10패'),
	('14', '디트로이트', 'CEN', '82', '23', '59', '0.280', '30.0', '13', '28', '10', '31', '6', '10', '3패'),
	('15', '올랜도', 'SEA', '82', '22', '60', '0.268', '31.0', '12', '29', '10', '31', '3', '13', '1승');

-- 테이블 rec_21_22.player 구조 내보내기
CREATE TABLE IF NOT EXISTS `player` (
  `순위` varchar(50) DEFAULT NULL,
  `선수` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `득점` varchar(50) DEFAULT NULL,
  `어시스트` varchar(50) DEFAULT NULL,
  `리바운드` varchar(50) DEFAULT NULL,
  `스틸` varchar(50) DEFAULT NULL,
  `블락슛` varchar(50) DEFAULT NULL,
  `야투` varchar(50) DEFAULT NULL,
  `3점슛` varchar(50) DEFAULT NULL,
  `자유투` varchar(50) DEFAULT NULL,
  `야투성공률` varchar(50) DEFAULT NULL,
  `3점슛성공률` varchar(50) DEFAULT NULL,
  `자유투성공률` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_21_22.player:~20 rows (대략적) 내보내기
DELETE FROM `player`;
INSERT INTO `player` (`순위`, `선수`, `경기수`, `득점`, `어시스트`, `리바운드`, `스틸`, `블락슛`, `야투`, `3점슛`, `자유투`, `야투성공률`, `3점슛성공률`, `자유투성공률`) VALUES
	('1', '조엘 엠비드 (필라델피아)', '68', '30.6', '4.2', '11.7', '1.1', '1.5', '9.8', '1.4', '9.6', '49.9', '37.1', '81.4'),
	('2', '야니스 아데토쿤보 (밀워키)', '67', '29.9', '5.8', '11.6', '1.1', '1.4', '10.3', '1.1', '8.2', '55.3', '29.3', '72.2'),
	('3', '루카 돈치치 (댈러스)', '65', '28.4', '8.7', '9.1', '1.2', '0.6', '9.9', '3.1', '5.6', '45.7', '35.3', '74.4'),
	('3', '트레 영 (애틀랜타)', '76', '28.4', '9.7', '3.7', '1.0', '0.1', '9.4', '3.1', '6.6', '46.0', '38.2', '90.4'),
	('5', '더마 드로잔 (시카고)', '76', '27.9', '4.9', '5.1', '0.9', '0.3', '10.2', '0.7', '6.8', '50.4', '35.2', '87.7'),
	('6', '니콜라 요키치 (덴버)', '74', '27.1', '7.9', '13.8', '1.5', '0.8', '10.3', '1.3', '5.1', '58.3', '33.7', '81.0'),
	('7', '제이슨 테이텀 (보스턴)', '76', '26.9', '4.4', '8.0', '1.0', '0.6', '9.3', '3.0', '5.3', '45.3', '35.3', '85.3'),
	('8', '데빈 부커 (피닉스)', '68', '26.8', '4.8', '5.0', '1.1', '0.4', '9.7', '2.7', '4.6', '46.6', '38.3', '86.8'),
	('9', '도노반 미첼 (클리블랜드)', '67', '25.9', '5.3', '4.2', '1.5', '0.2', '9.2', '3.5', '4.0', '44.8', '35.5', '85.3'),
	('10', '스테판 커리 (골든스테이트)', '64', '25.5', '6.3', '5.2', '1.3', '0.4', '8.4', '4.4', '4.3', '43.7', '38.0', '92.3'),
	('11', '칼-앤서니 타운스 (미네소타)', '74', '24.6', '3.6', '9.8', '1.0', '1.1', '8.7', '2.0', '5.2', '52.9', '41.0', '82.2'),
	('12', '잭 라빈 (시카고)', '67', '24.4', '4.5', '4.6', '0.6', '0.3', '8.4', '2.8', '4.8', '47.6', '38.9', '85.3'),
	('13', '제이렌 브라운 (보스턴)', '66', '23.6', '3.5', '6.1', '1.1', '0.3', '8.7', '2.5', '3.6', '47.3', '35.8', '75.8'),
	('14', '디애런 팍스 (새크라멘토)', '59', '23.2', '5.6', '3.9', '1.2', '0.4', '8.8', '1.2', '4.4', '47.3', '29.7', '75.0'),
	('15', '파스칼 시아캄 (토론토)', '68', '22.8', '5.3', '8.5', '1.2', '0.6', '8.8', '1.1', '4.2', '49.4', '34.4', '74.9'),
	('16', 'C.J. 맥컬럼 (뉴올리언스)', '62', '22.1', '5.1', '4.3', '1.1', '0.4', '8.6', '2.9', '1.9', '46.0', '38.8', '68.2'),
	('17', '제임스 하든 (필라델피아)', '65', '22.0', '10.3', '7.7', '1.3', '0.6', '6.3', '2.3', '7.2', '41.0', '33.0', '87.7'),
	('18', '다리우스 갈란드 (클리블랜드)', '68', '21.7', '8.6', '3.3', '1.3', '0.1', '8.0', '2.6', '3.2', '46.2', '38.3', '89.2'),
	('19', '앤서니 에드워즈 (미네소타)', '72', '21.3', '3.8', '4.8', '1.5', '0.6', '7.6', '3.0', '3.1', '44.1', '35.7', '78.6'),
	('20', '디욘테 머레이 (애틀랜타)', '68', '21.1', '9.2', '8.3', '2.0', '0.3', '8.4', '1.4', '2.9', '46.2', '32.7', '79.4');

-- 테이블 rec_21_22.west 구조 내보내기
CREATE TABLE IF NOT EXISTS `west` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_21_22.west:~15 rows (대략적) 내보내기
DELETE FROM `west`;
INSERT INTO `west` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '피닉스', 'PAC', '82', '64', '18', '0.780', '0.0', '32', '9', '32', '9', '10', '6', '1패'),
	('2', '멤피스', 'SWE', '82', '56', '26', '0.683', '8.0', '30', '11', '26', '15', '11', '5', '1패'),
	('3', '골든스테이트', 'PAC', '82', '53', '29', '0.646', '11.0', '31', '10', '22', '19', '12', '4', '5승'),
	('4', '댈러스', 'SWE', '82', '52', '30', '0.634', '12.0', '29', '12', '23', '18', '14', '2', '4승'),
	('5', '유타', 'NWE', '82', '49', '33', '0.598', '15.0', '29', '12', '20', '21', '15', '1', '1승'),
	('6', '덴버', 'NWE', '82', '48', '34', '0.585', '16.0', '23', '18', '25', '16', '6', '10', '1패'),
	('7', '미네소타', 'NWE', '82', '46', '36', '0.561', '18.0', '26', '15', '20', '21', '12', '4', '1패'),
	('8', '뉴올리언스', 'SWE', '82', '36', '46', '0.439', '28.0', '19', '22', '17', '24', '6', '10', '2패'),
	('9', 'LAC', 'PAC', '82', '42', '40', '0.512', '22.0', '25', '16', '17', '24', '9', '7', '5승'),
	('10', '샌안토니오', 'SWE', '82', '34', '48', '0.415', '30.0', '16', '25', '18', '23', '6', '10', '3패'),
	('11', 'LAL', 'PAC', '82', '33', '49', '0.402', '31.0', '21', '20', '12', '29', '3', '13', '2승'),
	('12', '새크라멘토', 'PAC', '82', '30', '52', '0.366', '34.0', '16', '25', '14', '27', '6', '10', '1승'),
	('13', '포틀랜드', 'NWE', '82', '27', '55', '0.329', '37.0', '17', '24', '10', '31', '1', '15', '11패'),
	('14', '오클라호마시티', 'NWE', '82', '24', '58', '0.293', '40.0', '12', '29', '12', '29', '6', '10', '3패'),
	('15', '휴스턴', 'SWE', '82', '20', '62', '0.244', '44.0', '11', '30', '9', '32', '3', '13', '7패');


-- rec_22_23 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `rec_22_23` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;
USE `rec_22_23`;

-- 테이블 rec_22_23.east 구조 내보내기
CREATE TABLE IF NOT EXISTS `east` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_22_23.east:~15 rows (대략적) 내보내기
DELETE FROM `east`;
INSERT INTO `east` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '밀워키', 'CEN', '10', '9', '1', '0.900', '0.0', '7', '0', '2', '1', '2', '0', '1패'),
	('2', '클리블랜드', 'CEN', '10', '8', '2', '0.800', '1.0', '4', '0', '4', '2', '2', '0', '1패'),
	('3', '보스턴', 'ATL', '10', '7', '3', '0.700', '2.0', '3', '1', '4', '2', '2', '0', '3승'),
	('4', '애틀랜타', 'SEA', '10', '7', '3', '0.700', '2.0', '4', '1', '3', '2', '1', '1', '3승'),
	('5', '토론토', 'ATL', '11', '6', '5', '0.545', '3.5', '4', '1', '2', '4', '1', '2', '1패'),
	('6', '시카고', 'CEN', '12', '6', '6', '0.500', '4.0', '4', '2', '2', '4', '1', '1', '1승'),
	('7', '뉴욕', 'ATL', '10', '5', '5', '0.500', '4.0', '3', '2', '2', '3', '1', '1', '1승'),
	('8', '인디애나', 'CEN', '10', '5', '5', '0.500', '4.0', '3', '2', '2', '3', '1', '1', '2승'),
	('9', '워싱턴', 'SEA', '11', '5', '6', '0.455', '4.5', '2', '3', '3', '3', '1', '0', '1승'),
	('10', '필라델피아', 'ATL', '11', '5', '6', '0.455', '4.5', '2', '4', '3', '2', '1', '3', '1승'),
	('11', '브루클린', 'ATL', '11', '4', '7', '0.364', '5.5', '2', '4', '2', '3', '1', '0', '1패'),
	('12', '마이애미', 'SEA', '11', '4', '7', '0.364', '5.5', '3', '4', '1', '3', '0', '0', '2패'),
	('13', '샬럿', 'SEA', '11', '3', '8', '0.273', '6.5', '1', '4', '2', '4', '1', '2', '5패'),
	('14', '디트로이트', 'CEN', '11', '3', '8', '0.273', '6.5', '3', '3', '0', '5', '0', '4', '1승'),
	('15', '올랜도', 'SEA', '11', '2', '9', '0.182', '7.5', '2', '3', '0', '6', '1', '1', '2패');

-- 테이블 rec_22_23.player 구조 내보내기
CREATE TABLE IF NOT EXISTS `player` (
  `순위` varchar(50) DEFAULT NULL,
  `선수` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `득점` varchar(50) DEFAULT NULL,
  `어시스트` varchar(50) DEFAULT NULL,
  `리바운드` varchar(50) DEFAULT NULL,
  `스틸` varchar(50) DEFAULT NULL,
  `블락슛` varchar(50) DEFAULT NULL,
  `야투` varchar(50) DEFAULT NULL,
  `3점슛` varchar(50) DEFAULT NULL,
  `자유투` varchar(50) DEFAULT NULL,
  `야투성공률` varchar(50) DEFAULT NULL,
  `3점슛성공률` varchar(50) DEFAULT NULL,
  `자유투성공률` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_22_23.player:~20 rows (대략적) 내보내기
DELETE FROM `player`;
INSERT INTO `player` (`순위`, `선수`, `경기수`, `득점`, `어시스트`, `리바운드`, `스틸`, `블락슛`, `야투`, `3점슛`, `자유투`, `야투성공률`, `3점슛성공률`, `자유투성공률`) VALUES
	('1', '루카 돈치치 (댈러스)', '9', '36.0', '8.3', '8.4', '1.9', '0.6', '12.2', '2.4', '9.1', '52.4', '29.7', '78.1'),
	('2', '스테판 커리 (골든스테이트)', '10', '32.6', '6.9', '7.1', '1.1', '0.1', '10.8', '5.3', '5.7', '51.2', '43.1', '93.4'),
	('3', '야니스 아데토쿤보 (밀워키)', '9', '31.8', '5.3', '12.2', '1.1', '1.4', '11.4', '0.9', '8.0', '54.2', '26.7', '64.9'),
	('4', '도노반 미첼 (클리블랜드)', '9', '31.2', '6.0', '4.1', '1.3', '0.7', '10.8', '4.1', '5.6', '50.5', '45.1', '86.2'),
	('4', '제이슨 테이텀 (보스턴)', '10', '31.2', '4.0', '7.5', '0.8', '1.5', '10.0', '3.4', '7.8', '49.8', '37.0', '87.6'),
	('6', '케빈 듀란트 (브루클린)', '11', '31.0', '4.7', '6.0', '0.9', '1.9', '10.4', '1.6', '8.4', '51.6', '33.3', '93.0'),
	('7', '셰이 길저스...(오클라호마시티)', '9', '30.8', '5.8', '4.6', '2.1', '1.4', '11.6', '0.8', '6.9', '53.9', '30.4', '96.9'),
	('8', '자 모란트 (멤피스)', '10', '28.5', '7.1', '5.7', '0.9', '0.4', '9.6', '2.1', '7.2', '47.5', '45.7', '80.9'),
	('9', '트레 영 (애틀랜타)', '9', '28.2', '9.4', '3.3', '0.7', '0.2', '8.7', '2.4', '8.4', '38.0', '30.6', '91.6'),
	('10', '데빈 부커 (피닉스)', '10', '27.1', '5.1', '4.2', '0.9', '0.5', '9.5', '2.1', '6.0', '48.5', '36.2', '85.7'),
	('11', '카이리 어빙 (브루클린)', '8', '26.9', '5.1', '5.1', '1.5', '1.1', '9.8', '2.6', '4.8', '45.3', '28.0', '92.7'),
	('12', '디애런 팍스 (새크라멘토)', '8', '26.5', '4.8', '5.4', '0.8', '0.5', '9.9', '2.0', '4.8', '54.5', '37.2', '86.4'),
	('13', '폴 조지 (LAC)', '10', '25.3', '4.5', '6.1', '1.7', '0.3', '9.1', '3.2', '3.9', '47.9', '37.6', '84.8'),
	('14', '제이렌 브라운 (보스턴)', '10', '24.9', '2.8', '6.7', '0.9', '0.6', '9.0', '2.5', '4.4', '45.0', '33.8', '84.6'),
	('15', '파스칼 시아캄 (토론토)', '9', '24.8', '7.7', '9.3', '0.9', '0.6', '8.9', '1.4', '5.6', '47.9', '34.2', '72.5'),
	('16', '르브론 제임스 (LAL)', '9', '24.3', '7.1', '8.9', '1.0', '0.8', '9.8', '1.4', '3.3', '44.7', '21.0', '68.2'),
	('17', '데스몬드 벤 (멤피스)', '10', '24.0', '4.6', '5.0', '0.6', '0.3', '8.0', '3.9', '4.1', '46.0', '45.9', '89.1'),
	('18', '더마 드로잔 (시카고)', '12', '23.8', '4.3', '4.2', '1.2', '0.4', '7.8', '0.3', '7.8', '50.3', '23.5', '90.3'),
	('18', '켈던 존슨 (샌안토니오)', '10', '23.8', '3.8', '5.3', '1.1', '0.1', '8.3', '3.8', '3.4', '47.2', '42.7', '77.3'),
	('20', '타이리스 맥시 (필라델피아)', '11', '23.6', '4.0', '3.5', '0.9', '0.2', '8.6', '3.0', '3.6', '46.5', '41.8', '75.0');

-- 테이블 rec_22_23.west 구조 내보내기
CREATE TABLE IF NOT EXISTS `west` (
  `순위` varchar(50) DEFAULT NULL,
  `팀` varchar(50) DEFAULT NULL,
  `디비전` varchar(50) DEFAULT NULL,
  `경기수` varchar(50) DEFAULT NULL,
  `승` varchar(50) DEFAULT NULL,
  `패` varchar(50) DEFAULT NULL,
  `승률` varchar(50) DEFAULT NULL,
  `승차` varchar(50) DEFAULT NULL,
  `홈승` varchar(50) DEFAULT NULL,
  `홈패` varchar(50) DEFAULT NULL,
  `원정승` varchar(50) DEFAULT NULL,
  `원정패` varchar(50) DEFAULT NULL,
  `디비전승` varchar(50) DEFAULT NULL,
  `디비전패` varchar(50) DEFAULT NULL,
  `연속` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC;

-- 테이블 데이터 rec_22_23.west:~15 rows (대략적) 내보내기
DELETE FROM `west`;
INSERT INTO `west` (`순위`, `팀`, `디비전`, `경기수`, `승`, `패`, `승률`, `승차`, `홈승`, `홈패`, `원정승`, `원정패`, `디비전승`, `디비전패`, `연속`) VALUES
	('1', '유타', 'NWE', '12', '9', '3', '0.750', '0.0', '5', '0', '4', '3', '2', '1', '3승'),
	('2', '피닉스', 'PAC', '10', '7', '3', '0.700', '1.0', '6', '1', '1', '2', '2', '0', '1패'),
	('3', '포틀랜드', 'NWE', '10', '7', '3', '0.700', '1.0', '3', '2', '4', '1', '1', '0', '1승'),
	('4', '덴버', 'NWE', '10', '7', '3', '0.700', '1.0', '4', '0', '3', '3', '3', '2', '3승'),
	('5', '댈러스', 'SWE', '9', '6', '3', '0.667', '1.5', '5', '1', '1', '2', '1', '1', '4승'),
	('6', '멤피스', 'SWE', '11', '7', '4', '0.636', '1.5', '4', '1', '3', '3', '1', '1', '1패'),
	('7', 'LAC', 'PAC', '11', '6', '5', '0.545', '2.5', '2', '3', '4', '2', '2', '1', '1승'),
	('8', '뉴올리언스', 'SWE', '10', '5', '5', '0.500', '3.0', '2', '1', '3', '4', '1', '0', '2패'),
	('9', '샌안토니오', 'SWE', '11', '5', '6', '0.455', '3.5', '2', '4', '3', '2', '0', '0', '4패'),
	('10', '미네소타', 'NWE', '11', '5', '6', '0.455', '3.5', '4', '4', '1', '2', '2', '1', '1패'),
	('11', '오클라호마시티', 'NWE', '10', '4', '6', '0.400', '4.0', '3', '2', '1', '4', '0', '4', '3패'),
	('12', '골든스테이트', 'PAC', '11', '4', '7', '0.364', '4.5', '4', '1', '0', '6', '3', '1', '1승'),
	('13', '새크라멘토', 'PAC', '9', '3', '6', '0.333', '4.5', '1', '3', '2', '3', '0', '3', '1패'),
	('14', 'LAL', 'PAC', '10', '2', '8', '0.200', '6.0', '2', '4', '0', '4', '0', '2', '3패'),
	('15', '휴스턴', 'SWE', '11', '2', '9', '0.182', '6.5', '1', '2', '1', '7', '0', '1', '1승');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
